AlmAck/svdtonuttx/demo/h/da1470x_gpu_core.h
/****************************************************************************
 * ./tmp/da1470x_gpu_core.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __DA1470X_GPU_CORE_H
#define __DA1470X_GPU_CORE_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "da1470x_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define DA1470X_GPU_CORE_D2_CACHECTL_OFFSET        0x00C4 /* #49: Cache control register. Internal caches can be enabled/disabled and flushed */
#define DA1470X_GPU_CORE_D2_COLKEY_OFFSET          0x00E8 /* #58: Color key value. The R, G, and B components of the internal color represent */
#define DA1470X_GPU_CORE_D2_COLOR1_OFFSET          0x0064 /* #25: Base color register. All color registers are *write only*, reading will ret */
#define DA1470X_GPU_CORE_D2_COLOR2_OFFSET          0x0068 /* #26: Secondary color register. Secondary color is relevant only when rendering p */
#define DA1470X_GPU_CORE_D2_CONTROL_OFFSET         0x0000 /* #0: Geometry control register. This register controls the pixel enumeration and  */
#define DA1470X_GPU_CORE_D2_CONTROL2_OFFSET        0x0004 /* #1: Surface control register. This register controls the colorization, texturing */
#define DA1470X_GPU_CORE_D2_CONTROL3_OFFSET        0x0008 /* #2: Burst length limit control register. This register controls the burst length */
#define DA1470X_GPU_CORE_D2_DLISTSTART_OFFSET      0x00C8 /* #50: Displaylist start address. Setting a new displaylist base address (writing  */
#define DA1470X_GPU_CORE_D2_HWREVISION_OFFSET      0x00F0 /* #1: Hardware version and feature set ID. Read this (constant) register to identi */
#define DA1470X_GPU_CORE_D2_IRQCTL_OFFSET          0x00C0 /* #48: Interrupt control register. The GPU features three sources for interrupts.  */
#define DA1470X_GPU_CORE_D2_L1BAND_OFFSET          0x0058 /* #22: Limiter1 band width parameter. Postfilter - first two limiter outputs can b */
#define DA1470X_GPU_CORE_D2_L1START_OFFSET         0x0010 /* #4: Limiter1 start value. All limiter registers are *write only*, reading will r */
#define DA1470X_GPU_CORE_D2_L1XADD_OFFSET          0x0028 /* #10: Limiter1 X-Axis increment. The xadd value is the 16:16 fixedpoint differenc */
#define DA1470X_GPU_CORE_D2_L1YADD_OFFSET          0x0040 /* #16: Limiter1 Y-Axis increment. The yadd value is the 16:16 fixedpoint differenc */
#define DA1470X_GPU_CORE_D2_L2BAND_OFFSET          0x005C /* #23: Limiter2 band width parameter. See D2_L1BAND */
#define DA1470X_GPU_CORE_D2_L2START_OFFSET         0x0014 /* #5: Limiter2 start value. See D2_L1START */
#define DA1470X_GPU_CORE_D2_L2XADD_OFFSET          0x002C /* #11: Limiter2 X-Axis increment. See D2_L1XADD */
#define DA1470X_GPU_CORE_D2_L2YADD_OFFSET          0x0044 /* #17: Limiter2 Y-Axis increment. See D2_L1YADD */
#define DA1470X_GPU_CORE_D2_L3START_OFFSET         0x0018 /* #6: Limiter3 start value. See D2_L1START */
#define DA1470X_GPU_CORE_D2_L3XADD_OFFSET          0x0030 /* #12: Limiter3 X-Axis increment */
#define DA1470X_GPU_CORE_D2_L3YADD_OFFSET          0x0048 /* #18: Limiter3 Y-Axis increment. See D2_L1YADD */
#define DA1470X_GPU_CORE_D2_L4START_OFFSET         0x001C /* #7: Limiter4 start value. See D2_L1START */
#define DA1470X_GPU_CORE_D2_L4XADD_OFFSET          0x0034 /* #13: Limiter4 X-Axis increment. See D2_L1XADD */
#define DA1470X_GPU_CORE_D2_L4YADD_OFFSET          0x004C /* #19: Limiter4 Y-Axis increment. See D2_L1YADD */
#define DA1470X_GPU_CORE_D2_L5START_OFFSET         0x0020 /* #8: Limiter5 start value. See D2_L1START */
#define DA1470X_GPU_CORE_D2_L5XADD_OFFSET          0x0038 /* #14: Limiter5 X-Axis increment. See D2_L1XADD */
#define DA1470X_GPU_CORE_D2_L5YADD_OFFSET          0x0050 /* #20: Limiter5 Y-Axis increment. See D2_L1YADD */
#define DA1470X_GPU_CORE_D2_L6START_OFFSET         0x0024 /* #9: Limiter6 start value. See D2_L1START */
#define DA1470X_GPU_CORE_D2_L6XADD_OFFSET          0x003C /* #15: Limiter6 X-Axis increment. See D2_L1XADD */
#define DA1470X_GPU_CORE_D2_L6YADD_OFFSET          0x0054 /* #21: Limiter6 Y-Axis increment. See D2_L1YADD */
#define DA1470X_GPU_CORE_D2_LUSTART_OFFSET         0x0090 /* #36: U Limiter start value. The start value is a 16:16 fixedpoint number valid a */
#define DA1470X_GPU_CORE_D2_LUXADD_OFFSET          0x0094 /* #37: U Limiter X-Axis increment. The add value for U is the 16:16 fixedpoint dif */
#define DA1470X_GPU_CORE_D2_LUYADD_OFFSET          0x0098 /* #38: U Limiter Y-Axis increment. The add value for U is the 16:16 fixedpoint dif */
#define DA1470X_GPU_CORE_D2_LVSTARTF_OFFSET        0x00A0 /* #40: V Limiter start value fractional part. The start value is a 32:16 fixedpoin */
#define DA1470X_GPU_CORE_D2_LVSTARTI_OFFSET        0x009C /* #39: V Limiter start value integer part */
#define DA1470X_GPU_CORE_D2_LVXADDI_OFFSET         0x00A4 /* #41: V Limiter X-Axis increment integer part. The add value for V is the 32:16 f */
#define DA1470X_GPU_CORE_D2_LVYADDI_OFFSET         0x00A8 /* #42: V Limiter Y-Axis increment integer part. The add value for V is the 32:16 f */
#define DA1470X_GPU_CORE_D2_LVYXADDF_OFFSET        0x00AC /* #43: V Limiter X and Y increment fractional parts */
#define DA1470X_GPU_CORE_D2_ORIGIN_OFFSET          0x0080 /* #32: Address of the first pixel in framebuffer. Writing to D2_ORIGIN will trigge */
#define DA1470X_GPU_CORE_D2_PATTERN_OFFSET         0x0074 /* #29: Pattern register. Each bit in the pattern register is interpreted as a refe */
#define DA1470X_GPU_CORE_D2_PERFCOUNT1_OFFSET      0x00CC /* #51: Performance counter. Writing to the D2_PERFCOUNT1 register resets the first */
#define DA1470X_GPU_CORE_D2_PERFCOUNT2_OFFSET      0x00D0 /* #52: Performance counter. Writing to the D2_PERFCOUNT2 register resets the secon */
#define DA1470X_GPU_CORE_D2_PERFTRIGGER_OFFSET     0x00D4 /* #53: Performance counters control register. Select the internal event that will  */
#define DA1470X_GPU_CORE_D2_PITCH_OFFSET           0x007C /* #31: Framebuffer pitch and spanstore delay */
#define DA1470X_GPU_CORE_D2_SIZE_OFFSET            0x0078 /* #30: Bounding box dimension */
#define DA1470X_GPU_CORE_D2_STATUS_OFFSET          0x00F4 /* #0: Status control register. The current GPU status can be polled by reading thi */
#define DA1470X_GPU_CORE_D2_TEXCLUT_OFFSET         0x00D8 /* #54: Color Lookup Table for the indexed texture format 16x24bit
  Triggers a wri */
#define DA1470X_GPU_CORE_D2_TEXCLUT_ADDR_OFFSET    0x00DC /* #55: Color Lookup Table write address for the indexed texture format 256x32 bit. */
#define DA1470X_GPU_CORE_D2_TEXCLUT_DATA_OFFSET    0x00E0 /* #56: Color Lookup Table write data for the indexed texture format 256x32 bit. Wr */
#define DA1470X_GPU_CORE_D2_TEXCLUT_OFFSET_OFFSET  0x00E4 /* #57: Offset to the texture index for the indexed texture formats i8, i4, i2 and  */
#define DA1470X_GPU_CORE_D2_TEXMASK_OFFSET         0x00B8 /* #46: Texture size or texture address mask. Depending on the clamping mode this r */
#define DA1470X_GPU_CORE_D2_TEXORIGIN_OFFSET       0x00BC /* #47: Texture base address. All texture registers are *write only*, reading will  */
#define DA1470X_GPU_CORE_D2_TEXPITCH_OFFSET        0x00B4 /* #45: Texels per texture line
  Pitch is equal or bigger than texture width. */

