AlmAck/svdtonuttx/demo/h/da1470x_gpu_core.h
/* Register addresses *******************************************************/

#define DA1470X_GPU_CORE_BASE                      0x51001200 /* GPU_CORE registers */

#define DA1470X_GPU_CORE_D2_CACHECTL               (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_CACHECTL_OFFSET) /* #49: Cache control register. Internal caches can be enabled/disabled and flushed */
#define DA1470X_GPU_CORE_D2_COLKEY                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_COLKEY_OFFSET) /* #58: Color key value. The R, G, and B components of the internal color represent */
#define DA1470X_GPU_CORE_D2_COLOR1                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_COLOR1_OFFSET) /* #25: Base color register. All color registers are *write only*, reading will ret */
#define DA1470X_GPU_CORE_D2_COLOR2                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_COLOR2_OFFSET) /* #26: Secondary color register. Secondary color is relevant only when rendering p */
#define DA1470X_GPU_CORE_D2_CONTROL                (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_CONTROL_OFFSET) /* #0: Geometry control register. This register controls the pixel enumeration and  */
#define DA1470X_GPU_CORE_D2_CONTROL2               (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_CONTROL2_OFFSET) /* #1: Surface control register. This register controls the colorization, texturing */
#define DA1470X_GPU_CORE_D2_CONTROL3               (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_CONTROL3_OFFSET) /* #2: Burst length limit control register. This register controls the burst length */
#define DA1470X_GPU_CORE_D2_DLISTSTART             (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_DLISTSTART_OFFSET) /* #50: Displaylist start address. Setting a new displaylist base address (writing  */
#define DA1470X_GPU_CORE_D2_HWREVISION             (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_HWREVISION_OFFSET) /* #1: Hardware version and feature set ID. Read this (constant) register to identi */
#define DA1470X_GPU_CORE_D2_IRQCTL                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_IRQCTL_OFFSET) /* #48: Interrupt control register. The GPU features three sources for interrupts.  */
#define DA1470X_GPU_CORE_D2_L1BAND                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L1BAND_OFFSET) /* #22: Limiter1 band width parameter. Postfilter - first two limiter outputs can b */
#define DA1470X_GPU_CORE_D2_L1START                (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L1START_OFFSET) /* #4: Limiter1 start value. All limiter registers are *write only*, reading will r */
#define DA1470X_GPU_CORE_D2_L1XADD                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L1XADD_OFFSET) /* #10: Limiter1 X-Axis increment. The xadd value is the 16:16 fixedpoint differenc */
#define DA1470X_GPU_CORE_D2_L1YADD                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L1YADD_OFFSET) /* #16: Limiter1 Y-Axis increment. The yadd value is the 16:16 fixedpoint differenc */
#define DA1470X_GPU_CORE_D2_L2BAND                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L2BAND_OFFSET) /* #23: Limiter2 band width parameter. See D2_L1BAND */
#define DA1470X_GPU_CORE_D2_L2START                (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L2START_OFFSET) /* #5: Limiter2 start value. See D2_L1START */
#define DA1470X_GPU_CORE_D2_L2XADD                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L2XADD_OFFSET) /* #11: Limiter2 X-Axis increment. See D2_L1XADD */
#define DA1470X_GPU_CORE_D2_L2YADD                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L2YADD_OFFSET) /* #17: Limiter2 Y-Axis increment. See D2_L1YADD */
#define DA1470X_GPU_CORE_D2_L3START                (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L3START_OFFSET) /* #6: Limiter3 start value. See D2_L1START */
#define DA1470X_GPU_CORE_D2_L3XADD                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L3XADD_OFFSET) /* #12: Limiter3 X-Axis increment */
#define DA1470X_GPU_CORE_D2_L3YADD                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L3YADD_OFFSET) /* #18: Limiter3 Y-Axis increment. See D2_L1YADD */
#define DA1470X_GPU_CORE_D2_L4START                (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L4START_OFFSET) /* #7: Limiter4 start value. See D2_L1START */
#define DA1470X_GPU_CORE_D2_L4XADD                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L4XADD_OFFSET) /* #13: Limiter4 X-Axis increment. See D2_L1XADD */
#define DA1470X_GPU_CORE_D2_L4YADD                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L4YADD_OFFSET) /* #19: Limiter4 Y-Axis increment. See D2_L1YADD */
#define DA1470X_GPU_CORE_D2_L5START                (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L5START_OFFSET) /* #8: Limiter5 start value. See D2_L1START */
#define DA1470X_GPU_CORE_D2_L5XADD                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L5XADD_OFFSET) /* #14: Limiter5 X-Axis increment. See D2_L1XADD */
#define DA1470X_GPU_CORE_D2_L5YADD                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L5YADD_OFFSET) /* #20: Limiter5 Y-Axis increment. See D2_L1YADD */
#define DA1470X_GPU_CORE_D2_L6START                (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L6START_OFFSET) /* #9: Limiter6 start value. See D2_L1START */
#define DA1470X_GPU_CORE_D2_L6XADD                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L6XADD_OFFSET) /* #15: Limiter6 X-Axis increment. See D2_L1XADD */
#define DA1470X_GPU_CORE_D2_L6YADD                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_L6YADD_OFFSET) /* #21: Limiter6 Y-Axis increment. See D2_L1YADD */
#define DA1470X_GPU_CORE_D2_LUSTART                (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_LUSTART_OFFSET) /* #36: U Limiter start value. The start value is a 16:16 fixedpoint number valid a */
#define DA1470X_GPU_CORE_D2_LUXADD                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_LUXADD_OFFSET) /* #37: U Limiter X-Axis increment. The add value for U is the 16:16 fixedpoint dif */
#define DA1470X_GPU_CORE_D2_LUYADD                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_LUYADD_OFFSET) /* #38: U Limiter Y-Axis increment. The add value for U is the 16:16 fixedpoint dif */
#define DA1470X_GPU_CORE_D2_LVSTARTF               (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_LVSTARTF_OFFSET) /* #40: V Limiter start value fractional part. The start value is a 32:16 fixedpoin */
#define DA1470X_GPU_CORE_D2_LVSTARTI               (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_LVSTARTI_OFFSET) /* #39: V Limiter start value integer part */
#define DA1470X_GPU_CORE_D2_LVXADDI                (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_LVXADDI_OFFSET) /* #41: V Limiter X-Axis increment integer part. The add value for V is the 32:16 f */
#define DA1470X_GPU_CORE_D2_LVYADDI                (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_LVYADDI_OFFSET) /* #42: V Limiter Y-Axis increment integer part. The add value for V is the 32:16 f */
#define DA1470X_GPU_CORE_D2_LVYXADDF               (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_LVYXADDF_OFFSET) /* #43: V Limiter X and Y increment fractional parts */
#define DA1470X_GPU_CORE_D2_ORIGIN                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_ORIGIN_OFFSET) /* #32: Address of the first pixel in framebuffer. Writing to D2_ORIGIN will trigge */
#define DA1470X_GPU_CORE_D2_PATTERN                (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_PATTERN_OFFSET) /* #29: Pattern register. Each bit in the pattern register is interpreted as a refe */
#define DA1470X_GPU_CORE_D2_PERFCOUNT1             (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_PERFCOUNT1_OFFSET) /* #51: Performance counter. Writing to the D2_PERFCOUNT1 register resets the first */
#define DA1470X_GPU_CORE_D2_PERFCOUNT2             (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_PERFCOUNT2_OFFSET) /* #52: Performance counter. Writing to the D2_PERFCOUNT2 register resets the secon */
#define DA1470X_GPU_CORE_D2_PERFTRIGGER            (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_PERFTRIGGER_OFFSET) /* #53: Performance counters control register. Select the internal event that will  */
#define DA1470X_GPU_CORE_D2_PITCH                  (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_PITCH_OFFSET) /* #31: Framebuffer pitch and spanstore delay */
#define DA1470X_GPU_CORE_D2_SIZE                   (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_SIZE_OFFSET) /* #30: Bounding box dimension */
#define DA1470X_GPU_CORE_D2_STATUS                 (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_STATUS_OFFSET) /* #0: Status control register. The current GPU status can be polled by reading thi */
#define DA1470X_GPU_CORE_D2_TEXCLUT                (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_TEXCLUT_OFFSET) /* #54: Color Lookup Table for the indexed texture format 16x24bit
  Triggers a wri */
#define DA1470X_GPU_CORE_D2_TEXCLUT_ADDR           (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_TEXCLUT_ADDR_OFFSET) /* #55: Color Lookup Table write address for the indexed texture format 256x32 bit. */
#define DA1470X_GPU_CORE_D2_TEXCLUT_DATA           (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_TEXCLUT_DATA_OFFSET) /* #56: Color Lookup Table write data for the indexed texture format 256x32 bit. Wr */
#define DA1470X_GPU_CORE_D2_TEXCLUT_OFFSET         (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_TEXCLUT_OFFSET_OFFSET) /* #57: Offset to the texture index for the indexed texture formats i8, i4, i2 and  */
#define DA1470X_GPU_CORE_D2_TEXMASK                (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_TEXMASK_OFFSET) /* #46: Texture size or texture address mask. Depending on the clamping mode this r */
#define DA1470X_GPU_CORE_D2_TEXORIGIN              (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_TEXORIGIN_OFFSET) /* #47: Texture base address. All texture registers are *write only*, reading will  */
#define DA1470X_GPU_CORE_D2_TEXPITCH               (DA1470X_GPU_CORE_BASE + DA1470X_GPU_CORE_D2_TEXPITCH_OFFSET) /* #45: Texels per texture line
  Pitch is equal or bigger than texture width. */

/* Register bit definitions *************************************************/


/* D2_CACHECTL Register */

#define GPU_CORE_D2C_CACHECTL_FLUSH_TX             (1U << 3) /* Flush texture cache */
#define GPU_CORE_D2C_CACHECTL_ENABLE_TX            (1U << 2) /* Texture cache enable */
#define GPU_CORE_D2C_CACHECTL_FLUSH_FB             (1U << 1) /* Flush framebuffer cache */
#define GPU_CORE_D2C_CACHECTL_ENABLE_FB            (1U << 0) /* Framebuffer cache enable */

/* D2_COLKEY Register */

#define GPU_CORE_COLKEY_RGB_MASK                   (0xFFFFFF << 0) /* Color Key Value RGB888 */
#define GPU_CORE_COLKEY_RGB_POS                    (0) /* Color Key Value RGB888 */

/* D2_COLOR1 Register */

