AlmAck/svdtonuttx/demo/h/da1470x_gpu_core.h
#define GPU_CORE_COLOR1_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_COLOR1_POS                        (0) /* No description available. */

/* D2_COLOR2 Register */

#define GPU_CORE_COLOR2_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_COLOR2_POS                        (0) /* No description available. */

/* D2_CONTROL Register */

#define GPU_CORE_D2C_LIMITERPRECISION              (1U << 24) /* Increase precision of limiters from 16.16 to 10.22 */
#define GPU_CORE_D2C_SPANSTORE                     (1U << 23) /* Nextline span start is always equal or left to current-line span start */
#define GPU_CORE_D2C_SPANABORT                     (1U << 22) /* Shape is horizontally convex. only a single span per scanline */
#define GPU_CORE_D2C_UNIONCD                       (1U << 21) /* Combine outputs C and D as union (output is final) */
#define GPU_CORE_D2C_UNIONAB                       (1U << 20) /* Combine outputs A and B as union (output is called C) */
#define GPU_CORE_D2C_UNION56                       (1U << 19) /* Combine limiter 5 and 6 as union (output is called D) */
#define GPU_CORE_D2C_UNION34                       (1U << 18) /* Combine limiter 3 and 4 as union (output is called B) */
#define GPU_CORE_D2C_UNION12                       (1U << 17) /* Combine limiter 1 and 2 as union (output is called A) */
#define GPU_CORE_D2C_BAND2ENABLE                   (1U << 16) /* Enable band postprocess for limiter 2 (see <D2_L2BAND>) */
#define GPU_CORE_D2C_BAND1ENABLE                   (1U << 15) /* Enable band postprocess for limiter 1 (see <D2_L1BAND>) */
#define GPU_CORE_D2C_LIM6THRESHOLD                 (1U << 14) /* Enable limiter 6 threshold mode */
#define GPU_CORE_D2C_LIM5THRESHOLD                 (1U << 13) /* Enable limiter 5 threshold mode */
#define GPU_CORE_D2C_LIM4THRESHOLD                 (1U << 12) /* Enable limiter 4 threshold mode */
#define GPU_CORE_D2C_LIM3THRESHOLD                 (1U << 11) /* Enable limiter 3 threshold mode */
#define GPU_CORE_D2C_LIM2THRESHOLD                 (1U << 10) /* Enable limiter 2 threshold mode */
#define GPU_CORE_D2C_LIM1THRESHOLD                 (1U << 9) /* Enable limiter 1 threshold mode */
#define GPU_CORE_D2C_QUAD3ENABLE                   (1U << 8) /* Enable quadratic coupling of limiters 5 and 6 */
#define GPU_CORE_D2C_QUAD2ENABLE                   (1U << 7) /* Enable quadratic coupling of limiters 3 and 4 */
#define GPU_CORE_D2C_QUAD1ENABLE                   (1U << 6) /* Enable quadratic coupling of limiters 1 and 2 */
#define GPU_CORE_D2C_LIM6ENABLE                    (1U << 5) /* Enable limiter 6 */
#define GPU_CORE_D2C_LIM5ENABLE                    (1U << 4) /* Enable limiter 5 */
#define GPU_CORE_D2C_LIM4ENABLE                    (1U << 3) /* Enable limiter 4 */
#define GPU_CORE_D2C_LIM3ENABLE                    (1U << 2) /* Enable limiter 3 */
#define GPU_CORE_D2C_LIM2ENABLE                    (1U << 1) /* Enable limiter 2 */
#define GPU_CORE_D2C_LIM1ENABLE                    (1U << 0) /* Enable limiter 1 */

/* D2_CONTROL2 Register */

#define GPU_CORE_D2C_RLEFORMAT2                    (1U << 31) /* Bit1 of RLE texel format */
#define GPU_CORE_D2C_RLEFORMAT1                    (1U << 30) /* Bit0 of RLE texel format  00 - 1 byte per pixel 01 - 2 byte per pixel 10 - 3 byt */
#define GPU_CORE_D2C_BDIA                          (1U << 29) /* Dst factor for alpha channel will be inverted (meaning 1-a or 1-1 depending on B */
#define GPU_CORE_D2C_BSIA                          (1U << 28) /* Src factor for alpha channel will be inverted (meaning 1-a or 1-1 depending on B */
#define GPU_CORE_D2C_CLUTFORMAT1                   (1U << 27) /* Bit0 of the CLUT entry format  0 - argb8888 (4 bpp) 1 - rgb565 (2 bpp x 2) two e */
#define GPU_CORE_D2C_COLKEY_ENABLE                 (1U << 26) /* Enable color keying (see also <D2_COLKEY> and feature bits of <D2_HWREVISION>) */
#define GPU_CORE_D2C_CLUT_ENABLE                   (1U << 25) /* Enable the use of the CLUT (see also feature bits of <D2_HWREVISION>); if disabl */
#define GPU_CORE_D2C_RLE_ENABLE                    (1U << 24) /* Enable RLE decoder (see also feature bits of <D2_HWREVISION>) */
#define GPU_CORE_D2C_WRITEALPHA2                   (1U << 23) /* Bit1 of the "alpha source" (depends on USE_ACB) */
#define GPU_CORE_D2C_WRITEALPHA1                   (1U << 22) /* Bit0 of the "alpha source" (depends on USE_ACB)  00 - alpha from D2_COLOR2 01 -  */
#define GPU_CORE_D2C_WRITEFORMAT2                  (1U << 21) /* Bit1 of the framebuffer format descriptor */
#define GPU_CORE_D2C_WRITEFORMAT1                  (1U << 20) /* Bit0 of the framebuffer format descriptor  000 - alpha8 (1 bpp) 001 - rgb565 (2  */
#define GPU_CORE_D2C_READFORMAT2                   (1U << 19) /* Bit1 of the texture format descriptor */
#define GPU_CORE_D2C_READFORMAT1                   (1U << 18) /* Bit0 of the texture format descriptor  0000 - alpha8 (1 bpp) 0001 - rgb565 (2 bp */
#define GPU_CORE_D2C_TEXTUREFILTERY                (1U << 17) /* Linear filtering on texture v axis */
#define GPU_CORE_D2C_TEXTUREFILTERX                (1U << 16) /* Linear filtering on texture u axis */
#define GPU_CORE_D2C_TEXTURECLAMPY                 (1U << 15) /* Clamp instead of mask v coordinate */
#define GPU_CORE_D2C_TEXTURECLAMPX                 (1U << 14) /* Clamp instead of mask u coordinate */
#define GPU_CORE_D2C_BC2                           (1U << 13) /* Blending for color channels is done with <D2_COLOR2> instead of the real dst val */
#define GPU_CORE_D2C_BDI                           (1U << 12) /* Dst factor for color channels will be inverted (meaning 1-a or 1-1 depending on  */
#define GPU_CORE_D2C_BSI                           (1U << 11) /* Src factor for color channels will be inverted (meaning 1-a or 1-1 depending on  */
#define GPU_CORE_D2C_BDF                           (1U << 10) /* Dst factor for color channels is alpha (factor is 1 per default) */
#define GPU_CORE_D2C_BSF                           (1U << 9) /* Src factor for color channels is alpha (factor is 1 per default) */
#define GPU_CORE_D2C_WRITEFORMAT3                  (1U << 8) /* Bit2 of the framebuffer format descriptor */
#define GPU_CORE_D2C_BDFA                          (1U << 7) /* Dst factor for alpha channel is alpha (factor is 1 per default) */
#define GPU_CORE_D2C_BSFA                          (1U << 6) /* Src factor for alpha channel is alpha (factor is 1 per default) */
#define GPU_CORE_D2C_READFORMAT4                   (1U << 5) /* Bit3 of the texture format descriptor */
#define GPU_CORE_D2C_READFORMAT3                   (1U << 4) /* Bit2 of the texture format descriptor */
#define GPU_CORE_USE_ACB                           (1U << 3) /* Use full alpha channel blending, else use write-alpha mode */
#define GPU_CORE_D2C_PATTERNSOURCEL5               (1U << 2) /* Limiter 5 is used as pattern index instead of the default U-Limiter */
#define GPU_CORE_D2C_TEXTUREENABLE                 (1U << 1) /* Pixel source is read from texture and used as an alpha to blend between <D2_COLO */
#define GPU_CORE_D2C_PATTERNENABLE                 (1U << 0) /* Pixel source is a pattern color (blend of <D2_COLOR1> and <D2_COLOR2> depending  */

/* D2_CONTROL3 Register */

#define GPU_CORE_BURSTLENGTH_MDL_MASK              (0x7 << 24) /* Burst length limit for MDL read (other values are not allowed) 0: single word tr */
#define GPU_CORE_BURSTLENGTH_MDL_POS               (24) /* Burst length limit for MDL read (other values are not allowed) 0: single word tr */
#define GPU_CORE_BURSTLENGTH_MTX_MASK              (0x7 << 16) /* Burst length limit for MTX read (other values are not allowed) 0: single word tr */
#define GPU_CORE_BURSTLENGTH_MTX_POS               (16) /* Burst length limit for MTX read (other values are not allowed) 0: single word tr */
#define GPU_CORE_BURSTLENGTH_MFBW_MASK             (0x7 << 8) /* Burst length limit for MFB write (other values are not allowed) 0: single word t */
#define GPU_CORE_BURSTLENGTH_MFBW_POS              (8) /* Burst length limit for MFB write (other values are not allowed) 0: single word t */
#define GPU_CORE_BURSTLENGTH_MFBR_MASK             (0x7 << 0) /* Burst length limit for MFB read (other values are not allowed) 0: single word tr */
#define GPU_CORE_BURSTLENGTH_MFBR_POS              (0) /* Burst length limit for MFB read (other values are not allowed) 0: single word tr */

/* D2_DLISTSTART Register */

#define GPU_CORE_DLISTSTART_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_DLISTSTART_POS                    (0) /* No description available. */

/* D2_HWREVISION Register */

#define GPU_CORE_FB_BURSTSPLITTING                 (1U << 28) /* Bursts can be split with respect to burst length limit */
#define GPU_CORE_FB_ALPHACHANNELBLENDING           (1U << 27) /* Full alpha channel blending available */
#define GPU_CORE_FB_HILIMITERPRECISION             (1U << 26) /* Increasable precision of limiters available */
#define GPU_CORE_FB_COLORKEY                       (1U << 25) /* Color keying available */
#define GPU_CORE_FB_TEXCLUT256                     (1U << 24) /* Extend CLUT to 256x32bit ARGB8888 */
#define GPU_CORE_FB_RLEUNIT                        (1U << 23) /* RLE texture decoder available */
#define GPU_CORE_FB_FBPREFETCH                     (1U << 22) /* Framebuffer prefetch available */
#define GPU_CORE_FB_TEXCLUT                        (1U << 21) /* Color Lookup Table 16x24bit for indexed textureformat available */
#define GPU_CORE_FB_PERFCOUNT                      (1U << 20) /* Two performance counters available */
#define GPU_CORE_FB_TXCACHE                        (1U << 19) /* Texture Cache available */
#define GPU_CORE_FB_FBCACHE                        (1U << 18) /* Framebuffer Cache available */
#define GPU_CORE_FB_DLR                            (1U << 17) /* DisplayListReader available */
#define GPU_CORE_FB_SWGPU                          (1U << 16) /* Software GPU */
#define GPU_CORE_HWTYPE_MASK                       (0xF << 12) /* GPU Type */
#define GPU_CORE_HWTYPE_POS                        (12) /* GPU Type */
#define GPU_CORE_HWBRANCH_MASK                     (0xF << 8) /* Branch number */
#define GPU_CORE_HWBRANCH_POS                      (8) /* Branch number */
#define GPU_CORE_HWREVISION_MASK                   (0xFF << 0) /* Revision number */
#define GPU_CORE_HWREVISION_POS                    (0) /* Revision number */

/* D2_IRQCTL Register */

