AlmAck/svdtonuttx/demo/h/da1470x_gpu_core.h
#define GPU_CORE_D2IRQCTL_CLR_BUS_ERROR            (1U << 5) /* Clear Interrupt "Bus error" */
#define GPU_CORE_D2IRQCTL_ENABLE_BUS_ERROR         (1U << 4) /* Interruptmask enable "Bus error" */
#define GPU_CORE_D2IRQCTL_CLR_FINISH_DLIST         (1U << 3) /* Clear Interrupt "Displaylist is finished". Make sure to clear the IRQ before sta */
#define GPU_CORE_D2IRQCTL_CLR_FINISH_ENUM          (1U << 2) /* Clear Interrupt "Enumeration is finished" */
#define GPU_CORE_D2IRQCTL_ENABLE_FINISH_DLIST      (1U << 1) /* Interruptmask enable "Displaylist is finished" */
#define GPU_CORE_D2IRQCTL_ENABLE_FINISH_ENUM       (1U << 0) /* Interruptmask enable "Enumeration is finished" */

/* D2_L1BAND Register */

#define GPU_CORE_L1BAND_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L1BAND_POS                        (0) /* No description available. */

/* D2_L1START Register */

#define GPU_CORE_L1START_MASK                      (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L1START_POS                       (0) /* No description available. */

/* D2_L1XADD Register */

#define GPU_CORE_L1XADD_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L1XADD_POS                        (0) /* No description available. */

/* D2_L1YADD Register */

#define GPU_CORE_L1YADD_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L1YADD_POS                        (0) /* No description available. */

/* D2_L2BAND Register */

#define GPU_CORE_L2BAND_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L2BAND_POS                        (0) /* No description available. */

/* D2_L2START Register */

#define GPU_CORE_L2START_MASK                      (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L2START_POS                       (0) /* No description available. */

/* D2_L2XADD Register */

#define GPU_CORE_L2XADD_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L2XADD_POS                        (0) /* No description available. */

/* D2_L2YADD Register */

#define GPU_CORE_L2YADD_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L2YADD_POS                        (0) /* No description available. */

/* D2_L3START Register */

#define GPU_CORE_L3START_MASK                      (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L3START_POS                       (0) /* No description available. */

/* D2_L3XADD Register */

#define GPU_CORE_L3XADD_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L3XADD_POS                        (0) /* No description available. */

/* D2_L3YADD Register */

#define GPU_CORE_L3YADD_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L3YADD_POS                        (0) /* No description available. */

/* D2_L4START Register */

#define GPU_CORE_L4START_MASK                      (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L4START_POS                       (0) /* No description available. */

/* D2_L4XADD Register */

#define GPU_CORE_L4XADD_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L4XADD_POS                        (0) /* No description available. */

/* D2_L4YADD Register */

#define GPU_CORE_L4YADD_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L4YADD_POS                        (0) /* No description available. */

/* D2_L5START Register */

#define GPU_CORE_L5START_MASK                      (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L5START_POS                       (0) /* No description available. */

/* D2_L5XADD Register */

#define GPU_CORE_L5XADD_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L5XADD_POS                        (0) /* No description available. */

/* D2_L5YADD Register */

#define GPU_CORE_L5YADD_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L5YADD_POS                        (0) /* No description available. */

/* D2_L6START Register */

#define GPU_CORE_L6START_MASK                      (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L6START_POS                       (0) /* No description available. */

/* D2_L6XADD Register */

#define GPU_CORE_L6XADD_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L6XADD_POS                        (0) /* No description available. */

/* D2_L6YADD Register */

#define GPU_CORE_L6YADD_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_L6YADD_POS                        (0) /* No description available. */

/* D2_LUSTART Register */

#define GPU_CORE_LUSTART_MASK                      (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_LUSTART_POS                       (0) /* No description available. */

/* D2_LUXADD Register */

#define GPU_CORE_LUXADD_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_LUXADD_POS                        (0) /* No description available. */

/* D2_LUYADD Register */

#define GPU_CORE_LUYADD_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_LUYADD_POS                        (0) /* No description available. */

/* D2_LVSTARTF Register */

#define GPU_CORE_LVSTARTF_MASK                     (0xFFFF << 0) /* Fractional part. */
#define GPU_CORE_LVSTARTF_POS                      (0) /* Fractional part. */

/* D2_LVSTARTI Register */

#define GPU_CORE_LVSTARTI_MASK                     (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_LVSTARTI_POS                      (0) /* No description available. */

