AlmAck/svdtonuttx/demo/h/da1470x_gpu_core.h
/* D2_LVXADDI Register */

#define GPU_CORE_LVXADDI_MASK                      (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_LVXADDI_POS                       (0) /* No description available. */

/* D2_LVYADDI Register */

#define GPU_CORE_LVYADDI_MASK                      (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_LVYADDI_POS                       (0) /* No description available. */

/* D2_LVYXADDF Register */

#define GPU_CORE_D2_LVYADDI_FRAC_MASK              (0xFFFF << 16) /* Y increment fractional part for <D2_LVYADDI>. */
#define GPU_CORE_D2_LVYADDI_FRAC_POS               (16) /* Y increment fractional part for <D2_LVYADDI>. */
#define GPU_CORE_D2_LVXADDI_FRAC_MASK              (0xFFFF << 0) /* X increment fractional part for <D2_LVXADDI>. */
#define GPU_CORE_D2_LVXADDI_FRAC_POS               (0) /* X increment fractional part for <D2_LVXADDI>. */

/* D2_ORIGIN Register */

#define GPU_CORE_ORIGIN_MASK                       (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_ORIGIN_POS                        (0) /* No description available. */

/* D2_PATTERN Register */

#define GPU_CORE_PATTERN_MASK                      (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_PATTERN_POS                       (0) /* No description available. */

/* D2_PERFCOUNT1 Register */

#define GPU_CORE_PERFCOUNT1_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_PERFCOUNT1_POS                    (0) /* No description available. */

/* D2_PERFCOUNT2 Register */

#define GPU_CORE_PERFCOUNT2_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_PERFCOUNT2_POS                    (0) /* No description available. */

/* D2_PERFTRIGGER Register */

#define GPU_CORE_PERFTRIGGER2_MASK                 (0xFFFF << 16) /* Select the internal event that will increment D2_PERFCOUNT2 register. */
#define GPU_CORE_PERFTRIGGER2_POS                  (16) /* Select the internal event that will increment D2_PERFCOUNT2 register. */
#define GPU_CORE_PERFTRIGGER1_MASK                 (0xFFFF << 0) /* Select the internal event that will increment D2_PERFCOUNT1 register. */
#define GPU_CORE_PERFTRIGGER1_POS                  (0) /* Select the internal event that will increment D2_PERFCOUNT1 register. */

/* D2_PITCH Register */

#define GPU_CORE_SSD_MASK                          (0xFFFF << 16) /* Spanstore delay, the number of scanlines to delay spanstore operations. */
#define GPU_CORE_SSD_POS                           (16) /* Spanstore delay, the number of scanlines to delay spanstore operations. */
#define GPU_CORE_PITCH_MASK                        (0xFFFF << 0) /* The width (in pixels) of one framebuffer scanline. A negative width can be used  */
#define GPU_CORE_PITCH_POS                         (0) /* The width (in pixels) of one framebuffer scanline. A negative width can be used  */

/* D2_SIZE Register */

#define GPU_CORE_SIZEY_MASK                        (0xFFFF << 16) /* The height (in pixels) of the primitives bounding box. */
#define GPU_CORE_SIZEY_POS                         (16) /* The height (in pixels) of the primitives bounding box. */
#define GPU_CORE_SIZEX_MASK                        (0xFFFF << 0) /* The width (in pixels) of the primitives bounding box. */
#define GPU_CORE_SIZEX_POS                         (0) /* The width (in pixels) of the primitives bounding box. */

/* D2_STATUS Register */

#define GPU_CORE_D2C_IRQ_BUS_ERROR_SRC_MASK        (0x7 << 8) /* Source interface of bus error */
#define GPU_CORE_D2C_IRQ_BUS_ERROR_SRC_POS         (8) /* Source interface of bus error */
#define GPU_CORE_D2C_IRQ_BUS_ERROR                 (1U << 6) /* IRQ on bus error */
#define GPU_CORE_D2C_IRQ_DLIST                     (1U << 5) /* IRQ on display list finish */
#define GPU_CORE_D2C_IRQ_ENUM                      (1U << 4) /* IRQ on enumeration finish */
#define GPU_CORE_D2C_DLISTACTIVE                   (1U << 3) /* Display list active, cant direct access hwregs */
#define GPU_CORE_D2C_CACHE_DIRTY                   (1U << 2) /* Framebuffer cache dirty, cant flip frame */
#define GPU_CORE_D2C_BUSY_WRITE                    (1U << 1) /* Framebuffer writeback busy, cant change framebuffer type */
#define GPU_CORE_D2C_BUSY_ENUM                     (1U << 0) /* Enumeration unit busy, cant start new primitive */

/* D2_TEXCLUT Register */

#define GPU_CORE_TEXCLUT_INDEX_MASK                (0xFF << 24) /* Index of the CLUT entry, that shall be written */
#define GPU_CORE_TEXCLUT_INDEX_POS                 (24) /* Index of the CLUT entry, that shall be written */
#define GPU_CORE_TEXCLUT_RGB_MASK                  (0xFFFFFF << 0) /* Color Value RGB888 */
#define GPU_CORE_TEXCLUT_RGB_POS                   (0) /* Color Value RGB888 */

/* D2_TEXCLUT_ADDR Register */

#define GPU_CORE_TEXCLUT_ADDR_MASK                 (0xFF << 0) /* Write address */
#define GPU_CORE_TEXCLUT_ADDR_POS                  (0) /* Write address */

/* D2_TEXCLUT_DATA Register */

#define GPU_CORE_TEXCLUT_ARGB_MASK                 (0xFFFFFFFF << 0) /* Color value ARGB8888 if CLUTFORMAT = argb8888 */
#define GPU_CORE_TEXCLUT_ARGB_POS                  (0) /* Color value ARGB8888 if CLUTFORMAT = argb8888 */

/* D2_TEXCLUT_OFFSET Register */

#define GPU_CORE_TEXCLUT_OFFSET_MASK               (0xFF << 0) /* Index offset */
#define GPU_CORE_TEXCLUT_OFFSET_POS                (0) /* Index offset */

/* D2_TEXMASK Register */

#define GPU_CORE_TEXVMASK_MASK                     (0x1FFFFF << 11) /* V mask. */
#define GPU_CORE_TEXVMASK_POS                      (11) /* V mask. */
#define GPU_CORE_TEXUMASK_MASK                     (0x7FF << 0) /* U mask. */
#define GPU_CORE_TEXUMASK_POS                      (0) /* U mask. */

/* D2_TEXORIGIN Register */

#define GPU_CORE_TEXORIGIN_MASK                    (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_TEXORIGIN_POS                     (0) /* No description available. */

/* D2_TEXPITCH Register */

#define GPU_CORE_TEXPITCH_MASK                     (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_TEXPITCH_POS                      (0) /* No description available. */

#endif /* __DA1470X_GPU_CORE_H */
